# Ex 2.6: Part 1(In Class)

- Data file:  **Global Superstore 2016.xlsx**

In [1]:
import pandas as pd

### Read the datafile File into a *pandas* Dataframe

In [2]:
df = pd.read_excel("Data/Global Superstore 2016.xlsx", "Orders", skiprows=0)

print(df.shape)
df.head()

(51290, 24)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Postal Code,City,...,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit,Shipping Cost,Order Priority
0,40098,CA-2014-AB10015140-41954,2014-11-11,2014-11-13,First Class,AB-100151402,Aaron Bergman,Consumer,73120.0,Oklahoma City,...,TEC-PH-5816,Technology,Phones,Samsung Convoy 3,221.980,2,0.0,62.1544,40.77,High
1,26341,IN-2014-JR162107-41675,2014-02-05,2014-02-07,Second Class,JR-162107,Justin Ritter,Corporate,NaN,Wollongong,...,FUR-CH-5379,Furniture,Chairs,"Novimex Executive Leather Armchair, Black",3709.395,9,0.1,-288.7650,923.63,Critical
2,25330,IN-2014-CR127307-41929,2014-10-17,2014-10-18,First Class,CR-127307,Craig Reiter,Consumer,NaN,Brisbane,...,TEC-PH-5356,Technology,Phones,"Nokia Smart Phone, with Caller ID",5175.171,9,0.1,919.9710,915.49,Medium
3,13524,ES-2014-KM1637548-41667,2014-01-28,2014-01-30,First Class,KM-1637548,Katherine Murray,Home Office,NaN,Berlin,...,TEC-PH-5267,Technology,Phones,"Motorola Smart Phone, Cordless",2892.510,5,0.1,-96.5400,910.16,Medium
4,47221,SG-2014-RH9495111-41948,2014-11-05,2014-11-06,Same Day,RH-9495111,Rick Hansen,Consumer,NaN,Dakar,...,TEC-CO-6011,Technology,Copiers,"Sharp Wireless Fax, High-Speed",2832.960,8,0.0,311.5200,903.04,Critical

In [3]:
# data types 'Before' 
df.dtypes

Row ID                     int64
Order ID                  object
Order Date        datetime64[ns]
Ship Date         datetime64[ns]
Ship Mode                 object
Customer ID               object
Customer Name             object
Segment                   object
Postal Code              float64
City                      object
State                     object
Country                   object
Region                    object
Market                    object
Product ID                object
Category                  object
Sub-Category              object
Product Name              object
Sales                    float64
Quantity                   int64
Discount                 float64
Profit                   float64
Shipping Cost            float64
Order Priority            object
dtype: object

# Q1.1: What are the Total Sales by Category and Segment?

In [12]:
ser1 = df.groupby(["Category", 'Segment'])['Sales'].sum()

ser1

Category         Segment
Furniture        Consumer       2.128121e+06
                 Corporate      1.264427e+06
                 Home Office    7.179039e+05
Office Supplies  Consumer       1.952788e+06
                 Corporate      1.142480e+06
                 Home Office    6.922249e+05
Technology       Consumer       2.427040e+06
                 Corporate      1.417791e+06
                 Home Office    8.997261e+05
Name: Sales, dtype: float64

In [13]:
# First, check that it is a pandas Series
type(ser1)

pandas.core.series.Series

In [14]:
# It is, convert it  to a Dataframe
df_Q1 = ser1.to_frame()

print(df_Q1.shape)
df_Q1

(9, 1)

                                    Sales
Category        Segment
Furniture       Consumer     2.128121e+06
                Corporate    1.264427e+06
                Home Office  7.179039e+05
Office Supplies Consumer     1.952788e+06
                Corporate    1.142480e+06
                Home Office  6.922249e+05
Technology      Consumer     2.427040e+06
                Corporate    1.417791e+06
                Home Office  8.997261e+05

In [15]:
df_Q1.reset_index(inplace=True)

print('Q1.1: What are the Total Sales by Category and Segment?')
print(df_Q1.shape)
df_Q1

Q1.1: What are the Total Sales by Category and Segment?
(9, 3)

          Category      Segment         Sales
0        Furniture     Consumer  2.128121e+06
1        Furniture    Corporate  1.264427e+06
2        Furniture  Home Office  7.179039e+05
3  Office Supplies     Consumer  1.952788e+06
4  Office Supplies    Corporate  1.142480e+06
5  Office Supplies  Home Office  6.922249e+05
6       Technology     Consumer  2.427040e+06
7       Technology    Corporate  1.417791e+06
8       Technology  Home Office  8.997261e+05

# Q1.2: What are the Top 10 Countries for Average Sales?

In [8]:
ser2 = df.groupby(["Country"])['Sales'].mean()

ser2

Country
Afghanistan       394.060364
Albania           243.007500
Algeria           184.140765
Angola            209.459016
Argentina         147.466111
                     ...
Vietnam           247.947018
Western Sahara    333.180000
Yemen              82.190400
Zambia            255.250000
Zimbabwe           47.063813
Name: Sales, Length: 165, dtype: float64

In [9]:
# First, check that it is a pandas Series
type(ser2)

pandas.core.series.Series

In [10]:
# It is, convert it  to a Dataframe
df_Q2 = ser2.to_frame()

print(df_Q2.shape)
df_Q2

(165, 1)

                     Sales
Country
Afghanistan     394.060364
Albania         243.007500
Algeria         184.140765
Angola          209.459016
Argentina       147.466111
...                    ...
Vietnam         247.947018
Western Sahara  333.180000
Yemen            82.190400
Zambia          255.250000
Zimbabwe         47.063813

[165 rows x 1 columns]

In [11]:
df_Q2.reset_index(inplace=True)
df_Q2.sort_values(by='Sales', ascending=False, inplace=True)
df_TopN = df_Q2.iloc[ : 10]


print('Q1.2: What are the Top 10 Countries for Average Sales? ')
print(df_TopN.shape)
df_TopN

Q1.2: What are the Top 10 Countries for Average Sales?
(10, 2)

          Country        Sales
82        Lesotho  1118.665000
78         Kuwait  1094.220000
97     Montenegro  1001.092500
28           Chad   658.515000
22   Burkina Faso   592.355000
142        Taiwan   546.259286
133   South Sudan   522.810000
56         Greece   521.597000
129      Slovenia   489.980000
10     Bangladesh   480.101043